Gualor/PSoC-Final-Project/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA.cydsn/codegentemp/TIMER_BUTTON.c
/*******************************************************************************
* File Name: TIMER_BUTTON.c
* Version 2.80
*
* Description:
*  The Timer component consists of a 8, 16, 24 or 32-bit timer with
*  a selectable period between 2 and 2^Width - 1.  The timer may free run
*  or be used as a capture timer as well.  The capture can be initiated
*  by a positive or negative edge signal as well as via software.
*  A trigger input can be programmed to enable the timer on rising edge
*  falling edge, either edge or continous run.
*  Interrupts may be generated due to a terminal count condition
*  or a capture event.
*
* Note:
*
********************************************************************************
* Copyright 2008-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
********************************************************************************/

#include "TIMER_BUTTON.h"

uint8 TIMER_BUTTON_initVar = 0u;


/*******************************************************************************
* Function Name: TIMER_BUTTON_Init
********************************************************************************
*
* Summary:
*  Initialize to the schematic state
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_BUTTON_Init(void) 
{
    #if(!TIMER_BUTTON_UsingFixedFunction)
            /* Interrupt State Backup for Critical Region*/
            uint8 TIMER_BUTTON_interruptState;
    #endif /* Interrupt state back up for Fixed Function only */

    #if (TIMER_BUTTON_UsingFixedFunction)
        /* Clear all bits but the enable bit (if it's already set) for Timer operation */
        TIMER_BUTTON_CONTROL &= TIMER_BUTTON_CTRL_ENABLE;

        /* Clear the mode bits for continuous run mode */
        #if (CY_PSOC5A)
            TIMER_BUTTON_CONTROL2 &= ((uint8)(~TIMER_BUTTON_CTRL_MODE_MASK));
        #endif /* Clear bits in CONTROL2 only in PSOC5A */

        #if (CY_PSOC3 || CY_PSOC5LP)
            TIMER_BUTTON_CONTROL3 &= ((uint8)(~TIMER_BUTTON_CTRL_MODE_MASK));
        #endif /* CONTROL3 register exists only in PSoC3 OR PSoC5LP */

        /* Check if One Shot mode is enabled i.e. RunMode !=0*/
        #if (TIMER_BUTTON_RunModeUsed != 0x0u)
            /* Set 3rd bit of Control register to enable one shot mode */
            TIMER_BUTTON_CONTROL |= 0x04u;
        #endif /* One Shot enabled only when RunModeUsed is not Continuous*/

        #if (TIMER_BUTTON_RunModeUsed == 2)
            #if (CY_PSOC5A)
                /* Set last 2 bits of control2 register if one shot(halt on
                interrupt) is enabled*/
                TIMER_BUTTON_CONTROL2 |= 0x03u;
            #endif /* Set One-Shot Halt on Interrupt bit in CONTROL2 for PSoC5A */

            #if (CY_PSOC3 || CY_PSOC5LP)
                /* Set last 2 bits of control3 register if one shot(halt on
                interrupt) is enabled*/
                TIMER_BUTTON_CONTROL3 |= 0x03u;
            #endif /* Set One-Shot Halt on Interrupt bit in CONTROL3 for PSoC3 or PSoC5LP */

        #endif /* Remove section if One Shot Halt on Interrupt is not enabled */

        #if (TIMER_BUTTON_UsingHWEnable != 0)
            #if (CY_PSOC5A)
                /* Set the default Run Mode of the Timer to Continuous */
                TIMER_BUTTON_CONTROL2 |= TIMER_BUTTON_CTRL_MODE_PULSEWIDTH;
            #endif /* Set Continuous Run Mode in CONTROL2 for PSoC5A */

            #if (CY_PSOC3 || CY_PSOC5LP)
                /* Clear and Set ROD and COD bits of CFG2 register */
                TIMER_BUTTON_CONTROL3 &= ((uint8)(~TIMER_BUTTON_CTRL_RCOD_MASK));
                TIMER_BUTTON_CONTROL3 |= TIMER_BUTTON_CTRL_RCOD;

                /* Clear and Enable the HW enable bit in CFG2 register */
                TIMER_BUTTON_CONTROL3 &= ((uint8)(~TIMER_BUTTON_CTRL_ENBL_MASK));
                TIMER_BUTTON_CONTROL3 |= TIMER_BUTTON_CTRL_ENBL;

                /* Set the default Run Mode of the Timer to Continuous */
                TIMER_BUTTON_CONTROL3 |= TIMER_BUTTON_CTRL_MODE_CONTINUOUS;
            #endif /* Set Continuous Run Mode in CONTROL3 for PSoC3ES3 or PSoC5A */

        #endif /* Configure Run Mode with hardware enable */

        /* Clear and Set SYNCTC and SYNCCMP bits of RT1 register */
        TIMER_BUTTON_RT1 &= ((uint8)(~TIMER_BUTTON_RT1_MASK));
        TIMER_BUTTON_RT1 |= TIMER_BUTTON_SYNC;

        /*Enable DSI Sync all all inputs of the Timer*/
        TIMER_BUTTON_RT1 &= ((uint8)(~TIMER_BUTTON_SYNCDSI_MASK));
        TIMER_BUTTON_RT1 |= TIMER_BUTTON_SYNCDSI_EN;

        /* Set the IRQ to use the status register interrupts */
        TIMER_BUTTON_CONTROL2 |= TIMER_BUTTON_CTRL2_IRQ_SEL;
    #endif /* Configuring registers of fixed function implementation */

    /* Set Initial values from Configuration */
    TIMER_BUTTON_WritePeriod(TIMER_BUTTON_INIT_PERIOD);
    TIMER_BUTTON_WriteCounter(TIMER_BUTTON_INIT_PERIOD);

    #if (TIMER_BUTTON_UsingHWCaptureCounter)/* Capture counter is enabled */
        TIMER_BUTTON_CAPTURE_COUNT_CTRL |= TIMER_BUTTON_CNTR_ENABLE;
        TIMER_BUTTON_SetCaptureCount(TIMER_BUTTON_INIT_CAPTURE_COUNT);
    #endif /* Configure capture counter value */

    #if (!TIMER_BUTTON_UsingFixedFunction)
        #if (TIMER_BUTTON_SoftwareCaptureMode)
            TIMER_BUTTON_SetCaptureMode(TIMER_BUTTON_INIT_CAPTURE_MODE);
        #endif /* Set Capture Mode for UDB implementation if capture mode is software controlled */

        #if (TIMER_BUTTON_SoftwareTriggerMode)
            #if (!TIMER_BUTTON_UDB_CONTROL_REG_REMOVED)
                if (0u == (TIMER_BUTTON_CONTROL & TIMER_BUTTON__B_TIMER__TM_SOFTWARE))
                {
                    TIMER_BUTTON_SetTriggerMode(TIMER_BUTTON_INIT_TRIGGER_MODE);
                }
            #endif /* (!TIMER_BUTTON_UDB_CONTROL_REG_REMOVED) */
        #endif /* Set trigger mode for UDB Implementation if trigger mode is software controlled */

        /* CyEnterCriticalRegion and CyExitCriticalRegion are used to mark following region critical*/
        /* Enter Critical Region*/
        TIMER_BUTTON_interruptState = CyEnterCriticalSection();

        /* Use the interrupt output of the status register for IRQ output */
        TIMER_BUTTON_STATUS_AUX_CTRL |= TIMER_BUTTON_STATUS_ACTL_INT_EN_MASK;

