Gualor/PSoC-Final-Project/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA.cydsn/codegentemp/TIMER_BUTTON.c
        /* Exit Critical Region*/
        CyExitCriticalSection(TIMER_BUTTON_interruptState);

        #if (TIMER_BUTTON_EnableTriggerMode)
            TIMER_BUTTON_EnableTrigger();
        #endif /* Set Trigger enable bit for UDB implementation in the control register*/
		
		
        #if (TIMER_BUTTON_InterruptOnCaptureCount && !TIMER_BUTTON_UDB_CONTROL_REG_REMOVED)
            TIMER_BUTTON_SetInterruptCount(TIMER_BUTTON_INIT_INT_CAPTURE_COUNT);
        #endif /* Set interrupt count in UDB implementation if interrupt count feature is checked.*/

        TIMER_BUTTON_ClearFIFO();
    #endif /* Configure additional features of UDB implementation */

    TIMER_BUTTON_SetInterruptMode(TIMER_BUTTON_INIT_INTERRUPT_MODE);
}


/*******************************************************************************
* Function Name: TIMER_BUTTON_Enable
********************************************************************************
*
* Summary:
*  Enable the Timer
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_BUTTON_Enable(void) 
{
    /* Globally Enable the Fixed Function Block chosen */
    #if (TIMER_BUTTON_UsingFixedFunction)
        TIMER_BUTTON_GLOBAL_ENABLE |= TIMER_BUTTON_BLOCK_EN_MASK;
        TIMER_BUTTON_GLOBAL_STBY_ENABLE |= TIMER_BUTTON_BLOCK_STBY_EN_MASK;
    #endif /* Set Enable bit for enabling Fixed function timer*/

    /* Remove assignment if control register is removed */
    #if (!TIMER_BUTTON_UDB_CONTROL_REG_REMOVED || TIMER_BUTTON_UsingFixedFunction)
        TIMER_BUTTON_CONTROL |= TIMER_BUTTON_CTRL_ENABLE;
    #endif /* Remove assignment if control register is removed */
}


/*******************************************************************************
* Function Name: TIMER_BUTTON_Start
********************************************************************************
*
* Summary:
*  The start function initializes the timer with the default values, the
*  enables the timerto begin counting.  It does not enable interrupts,
*  the EnableInt command should be called if interrupt generation is required.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Global variables:
*  TIMER_BUTTON_initVar: Is modified when this function is called for the
*   first time. Is used to ensure that initialization happens only once.
*
*******************************************************************************/
void TIMER_BUTTON_Start(void) 
{
    if(TIMER_BUTTON_initVar == 0u)
    {
        TIMER_BUTTON_Init();

        TIMER_BUTTON_initVar = 1u;   /* Clear this bit for Initialization */
    }

    /* Enable the Timer */
    TIMER_BUTTON_Enable();
}


/*******************************************************************************
* Function Name: TIMER_BUTTON_Stop
********************************************************************************
*
* Summary:
*  The stop function halts the timer, but does not change any modes or disable
*  interrupts.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Side Effects: If the Enable mode is set to Hardware only then this function
*               has no effect on the operation of the timer.
*
*******************************************************************************/
void TIMER_BUTTON_Stop(void) 
{
    /* Disable Timer */
    #if(!TIMER_BUTTON_UDB_CONTROL_REG_REMOVED || TIMER_BUTTON_UsingFixedFunction)
        TIMER_BUTTON_CONTROL &= ((uint8)(~TIMER_BUTTON_CTRL_ENABLE));
    #endif /* Remove assignment if control register is removed */

    /* Globally disable the Fixed Function Block chosen */
    #if (TIMER_BUTTON_UsingFixedFunction)
        TIMER_BUTTON_GLOBAL_ENABLE &= ((uint8)(~TIMER_BUTTON_BLOCK_EN_MASK));
        TIMER_BUTTON_GLOBAL_STBY_ENABLE &= ((uint8)(~TIMER_BUTTON_BLOCK_STBY_EN_MASK));
    #endif /* Disable global enable for the Timer Fixed function block to stop the Timer*/
}


/*******************************************************************************
* Function Name: TIMER_BUTTON_SetInterruptMode
********************************************************************************
*
* Summary:
*  This function selects which of the interrupt inputs may cause an interrupt.
*  The twosources are caputure and terminal.  One, both or neither may
*  be selected.
*
* Parameters:
*  interruptMode:   This parameter is used to enable interrups on either/or
*                   terminal count or capture.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_BUTTON_SetInterruptMode(uint8 interruptMode) 
{
    TIMER_BUTTON_STATUS_MASK = interruptMode;
}


/*******************************************************************************
* Function Name: TIMER_BUTTON_SoftwareCapture
********************************************************************************
*
* Summary:
*  This function forces a capture independent of the capture signal.
*
* Parameters:
*  void
*
* Return:
*  void
*
* Side Effects:
*  An existing hardware capture could be overwritten.
*
*******************************************************************************/
void TIMER_BUTTON_SoftwareCapture(void) 
{
    /* Generate a software capture by reading the counter register */
    #if(TIMER_BUTTON_UsingFixedFunction)
        (void)CY_GET_REG16(TIMER_BUTTON_COUNTER_LSB_PTR);
    #else
        (void)CY_GET_REG8(TIMER_BUTTON_COUNTER_LSB_PTR_8BIT);
    #endif/* (TIMER_BUTTON_UsingFixedFunction) */
    /* Capture Data is now in the FIFO */
}


/*******************************************************************************
* Function Name: TIMER_BUTTON_ReadStatusRegister
********************************************************************************
*
* Summary:
*  Reads the status register and returns it's state. This function should use
*  defined types for the bit-field information as the bits in this register may
*  be permuteable.
*
* Parameters:
*  void
*
* Return:
*  The contents of the status register
*
* Side Effects:
*  Status register bits may be clear on read.
*
*******************************************************************************/
uint8   TIMER_BUTTON_ReadStatusRegister(void) 
{
    return (TIMER_BUTTON_STATUS);
}


#if (!TIMER_BUTTON_UDB_CONTROL_REG_REMOVED) /* Remove API if control register is unused */


