Gualor/PSoC-Final-Project/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA/AY1920_II_HW_FINAL_CARZANIGA_GUALNIERA.cydsn/codegentemp/TIMER_BUTTON.c
#if (TIMER_BUTTON_UsingHWCaptureCounter)


/*******************************************************************************
* Function Name: TIMER_BUTTON_SetCaptureCount
********************************************************************************
*
* Summary:
*  This function sets the capture count
*
* Parameters:
*  captureCount: A value between 2 and 127 inclusive is valid.  A value of 1
*                to 127 will cause the interrupt to delay by the same number of
*                captures.
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_BUTTON_SetCaptureCount(uint8 captureCount) 
{
    TIMER_BUTTON_CAP_COUNT = captureCount;
}


/*******************************************************************************
* Function Name: TIMER_BUTTON_ReadCaptureCount
********************************************************************************
*
* Summary:
*  This function reads the capture count setting
*
* Parameters:
*  void
*
* Return:
*  Returns the Capture Count Setting
*
*******************************************************************************/
uint8 TIMER_BUTTON_ReadCaptureCount(void) 
{
    return ((uint8)TIMER_BUTTON_CAP_COUNT);
}
#endif /* TIMER_BUTTON_UsingHWCaptureCounter */


/*******************************************************************************
* Function Name: TIMER_BUTTON_ClearFIFO
********************************************************************************
*
* Summary:
*  This function clears all capture data from the capture FIFO
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void TIMER_BUTTON_ClearFIFO(void) 
{
    while(0u != (TIMER_BUTTON_ReadStatusRegister() & TIMER_BUTTON_STATUS_FIFONEMP))
    {
        (void)TIMER_BUTTON_ReadCapture();
    }
}

#endif /* UDB Specific Functions */


/* [] END OF FILE */
